build/docs/annolet/annolet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Annolet for page transformation</title>
<!-- 2017-08-18 Fri 07:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../style/css/override.css" />
<link rel="icon" type="image/png" href="../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Annolet for page transformation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Function <code>annoletContainer()</code> to create a annolet container</a></li>
<li><a href="#sec-2">2. Function <code>loadHtml()</code> to inject html content into the annolet container.</a></li>
<li><a href="#sec-3">3. Function <code>getJsondata()</code> to get json data, which is then used to insert tags on the selected content.</a></li>
<li><a href="#sec-4">4. Function <code>annotateTag()</code> to insert tags on the selected content</a></li>
<li><a href="#sec-5">5. Function <code>addClickevents()</code> to add click events to the annolet elements.</a></li>
<li><a href="#sec-6">6. Function to invoke the following functions when the page loads.</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Function <code>annoletContainer()</code> to create a annolet container</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-js"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">annoletContainer</span>(){
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">appending a div(annolet container) to body element of a webpage.</span>
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">body</span> = document.getElementsByTagName(<span style="font-style: italic;">'body'</span>)[0];
    container = document.createElement(<span style="font-style: italic;">'div'</span>);
    container.id = <span style="font-style: italic;">'annolet-container'</span>;
    body.appendChild(container);

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">appending a CSS stylesheet to head element of a webpage, which is used to stylize the annolet container.</span>
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">linktag</span> = document.createElement(<span style="font-style: italic;">'link'</span>);
    linktag.rel = <span style="font-style: italic;">"stylesheet"</span>;
    linktag.type = <span style="font-style: italic;">"text/css"</span>;
    linktag.href = <span style="font-style: italic;">"https://cdn.rawgit.com/ren-admin/pgxfrm-annolet/semantic-overlay/src/pgxfrm-bookmarklet/annolet/css/pgxfrm-annolet.css"</span>; 
    document.getElementsByTagName(<span style="font-style: italic;">'head'</span>)[0].appendChild(linktag);
    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">injecting html code</span>
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">loadHtml();</span>
     document.getElementById(<span style="font-style: italic;">'annolet-container'</span>).innerHTML = <span style="font-style: italic;">"&lt;h4 id='annolet-header'&gt;Semantic Overlay&lt;/h4&gt;"</span>+
    <span style="font-style: italic;">"&lt;ul id='annolet-tools-menu' &gt;"</span>+
        <span style="font-style: italic;">"&lt;li class='annolet-menu-item'&gt;"</span>+
            <span style="font-style: italic;">"&lt;div style='position:relative;top:19px;display:inline-block;'&gt;"</span>+
                <span style="font-style: italic;">"&lt;button id='qa-category' class='annolet-menu-sub-item' &gt;Tag Q/A..!&lt;/button&gt;"</span>+<span style="font-style: italic;">"&lt;br&gt;"</span>+
                <span style="font-style: italic;">"&lt;select class='select-tools-menu' id='qa'&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='question'&gt;question&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='multiple-choice'&gt;multiple choice&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='correct-answer'&gt;correct answer&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='explanation'&gt;explanation&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='useful-links'&gt;useful-links&lt;/option&gt;"</span>+
                <span style="font-style: italic;">"&lt;/select&gt;"</span>+
            <span style="font-style: italic;">"&lt;/div&gt;"</span>+
            <span style="font-style: italic;">"&lt;div style='position:relative;top:19px;display:inline-block;'&gt;"</span>+
                <span style="font-style: italic;">"&lt;button id='product-category' class='annolet-menu-sub-item' &gt;Tag Product..!&lt;/button&gt;"</span>+<span style="font-style: italic;">"&lt;br&gt;"</span>+
                <span style="font-style: italic;">"&lt;select class='select-tools-menu' id='pd'&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='product-name'&gt;product name&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='model'&gt;model&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='price'&gt;price&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='seller'&gt;seller&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='brand'&gt;brand&lt;/option&gt;"</span>+
                <span style="font-style: italic;">"&lt;/select&gt;"</span>+
            <span style="font-style: italic;">"&lt;/div&gt;"</span>+
            <span style="font-style: italic;">"&lt;div style='position:relative;top:19px;display:inline-block;'&gt;"</span>+
                <span style="font-style: italic;">"&lt;button id='number-category' class='annolet-menu-sub-item' &gt;Tag Number..!&lt;/button&gt;"</span>+<span style="font-style: italic;">"&lt;br&gt;"</span>+
                <span style="font-style: italic;">"&lt;select class='select-tools-menu' id='num'&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='date'&gt;date&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='time'&gt;time&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='currency'&gt;currency&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='distance'&gt;distance&lt;/option&gt;"</span>+
                    <span style="font-style: italic;">"&lt;option value='weight'&gt;weight&lt;/option&gt;"</span>+
                <span style="font-style: italic;">"&lt;/select&gt;"</span>+
            <span style="font-style: italic;">"&lt;/div&gt;"</span>+<span style="font-style: italic;">"&lt;br&gt;"</span>+
            <span style="font-style: italic;">"&lt;button id='submit-btn' class='annolet-menu-sub-item' style='position:relative;top:19px;'&gt;Submit&lt;/button&gt;"</span>+
        <span style="font-style: italic;">"&lt;/li&gt;"</span>+
    <span style="font-style: italic;">"&lt;/ul&gt;"</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Function <code>loadHtml()</code> to inject html content into the annolet container.</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-js">  <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">loadHtml</span>()
  {
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">html_url</span> = <span style="font-style: italic;">"https://cdn.rawgit.com/ren-admin/pgxfrm-annolet/semantic-overlay/src/pgxfrm-bookmarklet/annolet/html_content.txt"</span>; 
    $.get(html_url, <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">data</span>, <span style="font-weight: bold; font-style: italic;">status</span>) {
        html_content = data;
        console.log(<span style="font-style: italic;">"Data: "</span> + html_content + <span style="font-style: italic;">"\nStatus: "</span> + status);
        document.getElementById(<span style="font-style: italic;">"annolet-container"</span>).innerHTML = html_content;
    }); 
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Function <code>getJsondata()</code> to get json data, which is then used to insert tags on the selected content.</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-js"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">getJsondata</span>()
{
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">url</span> = <span style="font-style: italic;">"https://cdn.rawgit.com/ren-admin/pgxfrm-annolet/semantic-overlay/src/pgxfrm-bookmarklet/annolet/custom_tags.json"</span>; 
    $.get(url, <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">data</span>, <span style="font-weight: bold; font-style: italic;">status</span>) {
        json_data = data;
        console.log(<span style="font-style: italic;">"Data: "</span> + json_data + <span style="font-style: italic;">"\nStatus: "</span> + status);
    });
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Function <code>annotateTag()</code> to insert tags on the selected content</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-js"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">annotateTag</span>(<span style="font-weight: bold; font-style: italic;">markup_category</span>) {
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">selected_tag</span> = document.getElementById(markup_category).value;
    <span style="font-weight: bold;">if</span>(markup_category == <span style="font-style: italic;">"qa"</span>) {
       <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">custom_tag</span> = document.createElement(json_data[<span style="font-style: italic;">'categories'</span>][0][<span style="font-style: italic;">'tags'</span>][0][selected_tag]);
       createCustomTag();
    }
    <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(markup_category == <span style="font-style: italic;">"pd"</span>) {
       <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">custom_tag</span> = document.createElement(json_data[<span style="font-style: italic;">'categories'</span>][1][<span style="font-style: italic;">'tags'</span>][0][selected_tag]);
       createCustomTag();
    }
    <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(markup_category == <span style="font-style: italic;">"num"</span>) {
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">custom_tag</span> = document.createElement(json_data[<span style="font-style: italic;">'categories'</span>][2][<span style="font-style: italic;">'tags'</span>][0][selected_tag]);
        createCustomTag();
    }
    <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">createCustomTag</span>() {
        <span style="font-weight: bold;">if</span>(window.getSelection){
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">userSelection</span> = window.getSelection()
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">userSelection_text</span> = userSelection.toString();
                custom_tag.textContent = userSelection_text;
        }
                <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> (document.selection &amp;&amp; document.selection.type != <span style="font-style: italic;">"Control"</span>) {
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">userSelection</span> = document.selection.createRange().text;
                custom_tag.textContent = userSelection;
        }      
        custom_tag.style.backgroundColor = <span style="font-style: italic;">"yellow"</span>;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">range</span> = userSelection.getRangeAt(0);
        range.deleteContents();
        range.insertNode(custom_tag);
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Function <code>addClickevents()</code> to add click events to the annolet elements.</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-js"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">addclickEvents</span>() {
    document.getElementById(<span style="font-style: italic;">'qa-category'</span>).addEventListener(<span style="font-style: italic;">'click'</span>, <span style="font-weight: bold;">function</span>() {
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">category</span> = json_data[<span style="font-style: italic;">"categories"</span>][0][<span style="font-style: italic;">"name"</span>];
        annotateTag(category);
    }, <span style="font-weight: bold; text-decoration: underline;">false</span>);
    document.getElementById(<span style="font-style: italic;">'product-category'</span>).addEventListener(<span style="font-style: italic;">'click'</span>, <span style="font-weight: bold;">function</span>() {
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">category</span> = json_data[<span style="font-style: italic;">"categories"</span>][1][<span style="font-style: italic;">"name"</span>];
        annotateTag(category);
    }, <span style="font-weight: bold; text-decoration: underline;">false</span>);
    document.getElementById(<span style="font-style: italic;">'number-category'</span>).addEventListener(<span style="font-style: italic;">'click'</span>, <span style="font-weight: bold;">function</span>() {
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">category</span> = json_data[<span style="font-style: italic;">"categories"</span>][2][<span style="font-style: italic;">"name"</span>];
        annotateTag(category);
    }, <span style="font-weight: bold; text-decoration: underline;">false</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Function to invoke the following functions when the page loads.</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-js">window.onload = <span style="font-weight: bold;">function</span>() {
    annoletContainer()
    getJsondata()
    addclickEvents()
};
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: [2017-8-11 Fri]</p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-08-18 Fri 07:53</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
